#### FlowDirectionType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing direction types for a connector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum FlowDirectionType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FlowDirectionType ``` |

| Visual C++ |
| --- |
| ``` public enum class FlowDirectionType ``` |

# Members

| Member name | Description |
| --- | --- |
| Bidirectional | Flow bidirectional |
| In | Flow in |
| Out | Flow out |

# See Also

Autodesk.Revit.DB Namespace